Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: For connecting to a Trinamic module or to a Trinamic evaluation board, different interfaces can be used.
it_it: Per la connessione a un modulo Trinamic o a una scheda di valutazione Trinamic, è possibile utilizzare diverse interfacce.

source: For connecting to the CAN bus, a CAN interface is needed.
it_it: Per la connessione al bus CAN, è necessaria un'interfaccia CAN.

source: For connecting via CAN bus a CAN interface that is supported by the IDE is needed.
it_it: Per la connessione tramite bus CAN è necessaria un'interfaccia CAN supportata dall'IDE.

source: For debugging purposes, breakpoints can be set.
it_it: Ai fini del debug, è possibile impostare dei breakpoint.

source: For detailed LCD and LVGL performance descriptions, please refer to Documentation
it_it: Per descrizioni dettagliate delle prestazioni di LCD e LVGL, fare riferimento alla Documentazione

source: For each CAN interface a TMCL CAN connection and a CANopen connection is shown in the tree view.
it_it: Per ogni interfaccia CAN, nella vista ad albero vengono visualizzate una connessione CAN TMCL e una connessione CANopen.

source: For each EMCY a time stamp, the error code, the error register (object 1001h) and the five additional bytes are shown.
it_it: Per ogni EMCY vengono visualizzati un timestamp, il codice di errore, il registro degli errori (oggetto 1001h) e i cinque byte aggiuntivi.

source: For each address, use Wire.beginTransmission(address) to start the transmission to the device at the specific address, and then use Wire.endTransmission() to end the transmission and get the error code.
it_it: Per ogni indirizzo, utilizza Wire.beginTransmission(address) per avviare la trasmissione al dispositivo all'indirizzo specificato, quindi utilizza Wire.endTransmission() per terminare la trasmissione e ottenere il codice di errore.

source: For each object the desired value can be entered, either as a decimal number or as a hexadecimal number (starting with “0x” like in C language).
it_it: Per ogni oggetto è possibile immettere il valore desiderato, sia come numero decimale che come numero esadecimale (che inizia con “0x” come nel linguaggio C).

source: For every CANopen device, an EDS file is provided by its vendor.
it_it: Per ogni dispositivo CANopen, il fornitore fornisce un file EDS.

source: For every command eight bytes are written (the command with checksum, but without a device address).
it_it: Per ogni comando vengono scritti otto byte (il comando con checksum, ma senza indirizzo del dispositivo).

source: For every register there are the following entries:
it_it: Per ogni registro sono presenti le seguenti voci:

source: For example, if an error passive alarm, a bus error alarm, a transmission failure alarm, or a transmission success alarm is triggered, print the corresponding message and output some status information such as the bus error count, the number of messages to be sent, the transmission error counter, and the transmission failure counter.
it_it: Ad esempio, se viene attivato un allarme passivo di errore, un allarme di errore del bus, un allarme di errore di trasmissione o un allarme di trasmissione riuscita, stampa il messaggio corrispondente e restituisce alcune informazioni sullo stato, come il conteggio degli errori del bus, il numero di messaggi da inviare, il contatore degli errori di trasmissione e il contatore degli errori di trasmissione.

source: For instance, copy the appropriate ".so" file into the I2C example:
it_it: Ad esempio, copiare il file ".so" appropriato nell'esempio I2C:

source: For library installation tutorial, please refer to Arduino library manager tutorial
it_it: Per il tutorial sull'installazione delle librerie, fare riferimento al Tutorial sul gestore librerie Arduino

source: For many TRINAMIC modules also a CANopen firmware is available.
it_it: Per molti moduli TRINAMIC è disponibile anche un firmware CANopen.

source: For modules equipped with RS232 or RS485 interface, an appropriate interface is also needed on the PC.
it_it: Per i moduli dotati di interfaccia RS232 o RS485, è necessaria anche un'interfaccia appropriata sul PC.

source: For modules that are only equipped with a CAN interface and that are used with CANopen firmware, it is necessary to switch them into boot loader mode using the CANopen tab of the Connection window prior to using the Firmware Update Tool.
it_it: Per i moduli dotati solo di interfaccia CAN e utilizzati con firmware CANopen, è necessario impostarli in modalità bootloader utilizzando la scheda CANopen della finestra "Connection" prima di utilizzare il Firmware Update Tool.

source: For more functions description, you can refer to CH347 Application Development Manual
it_it: Per una descrizione più dettagliata delle funzioni, consultare il Manuale di Sviluppo delle Applicazioni CH347

source: For more information about how to install the Espressif IDF plugin, see Install Espressif IDF Plugin
it_it: Per ulteriori informazioni su come installare il plugin Espressif IDF, consultare Installazione del plugin Espressif IDF

source: For most cases, leave these values at their default settings.
it_it: Nella maggior parte dei casi, lasciare questi valori alle impostazioni predefinite.

source: For most libraries, users can easily search and install them through the online library manager of the Arduino software.
it_it: Per la maggior parte delle librerie, gli utenti possono facilmente cercarle e installarle tramite il gestore di librerie online del software Arduino.

source: For names of labels the same rules as for names of symbolic constants apply.
it_it: Per i nomi delle etichette si applicano le stesse regole dei nomi delle costanti simboliche.

source: For non-touch, it is not connected
it_it: Per i dispositivi non touch, non è collegato

source: For performing PI tuning in the auto mode, the target flux is changed to a value at which the tuning is desired, normally this value should be not too high (relative to the motor rated current) and as a default it is set to 1000mA.
it_it: Per eseguire la regolazione PI in modalità automatica, il flusso target viene modificato a un valore al quale si desidera ottenere la regolazione; normalmente questo valore non dovrebbe essere troppo elevato (rispetto alla corrente nominale del motore) e, di default, è impostato a 1000 mA.

source: For position mode in manual mode the torque controller and velocity controller PI parameters can be adjusted in addition to the position P parameter
it_it: Per la modalità di posizione in modalità manuale, oltre al parametro P di posizione, è possibile regolare anche i parametri PI del controller di coppia e del controller di velocità.

source: For smooth operation, please read the FAQ carefully to understand possible problems in advance.
it_it: Per un funzionamento ottimale, si prega di leggere attentamente le FAQ per comprendere in anticipo eventuali problemi.

source: For such old modules, use the TMCL-IDE 2.x to perform the firmware update.
it_it: Per questi vecchi moduli, utilizzare TMCL-IDE 2.x per eseguire l'aggiornamento del firmware.

source: For this purpose a serial port (RS485, RS232 or TTL level) connected to the PC (for example via USB) or built into the PC (for example as a PCI card) is necessary.
it_it: A questo scopo è necessaria una porta seriale (RS485, RS232 o TTL) collegata al PC (ad esempio tramite USB) o integrata nel PC (ad esempio come scheda PCI).

source: For this purpose constant expressions can be used.
it_it: A questo scopo si possono utilizzare le espressioni costanti.

source: For this purpose, EDS (electronic data sheet) files are used.
it_it: A tale scopo, vengono utilizzati i file EDS (electronic data sheet).

source: For this purpose, a CAN interface is needed.
it_it: A questo scopo, è necessaria un'interfaccia CAN.

source: For this purpose, the driver files can be downloaded from the TRINAMIC website.
it_it: A questo scopo, i file del driver possono essere scaricati dal sito web TRINAMIC.

source: For this reason, the TMCL-IDE can search for more than one module on the CAN bus.
it_it: Per questo motivo, TMCL-IDE può cercare più di un modulo sul bus CAN.

source: For this reason, the TMCL-IDE can search for more than one module on the serial port.
it_it: Per questo motivo, TMCL-IDE può cercare più moduli sulla porta seriale.

source: For time triggered PDOs or synchronized PDOs it is mostly better to turn off this feature.
it_it: Per i PDO attivati ​​da tempo o sincronizzati è generalmente preferibile disattivare questa funzione.

source: For using a DCF file to configure a module, select the Configure Device tab page of the Device Configuration tool.
it_it: Per utilizzare un file DCF per configurare un modulo, selezionare il tab Configure Device del tool Device Configuration.

source: For using a module with USB connection just plug in the USB cable into the module and the PC.
it_it: Per utilizzare un modulo con connessione USB, è sufficiente collegare il cavo USB al modulo e al PC.

source: For using these local variables, some special commands are provided:
it_it: Per utilizzare queste variabili locali, sono disponibili alcuni comandi speciali:

source: For velocity mode in manual mode, the torque controller PI parameters can be adjusted as well.
it_it: Per la "velocity mode" in modalità manuale, è possibile regolare anche i parametri PI del controller di coppia.

source: Freewheeling mode: in StealthChop mode, a freewheeling mode can be chosen which becomes active when the motor is stopped and the standby current (axis parameter #7) is set to 0.
it_it: Freewheeling mode: in modalità StealthChop, è possibile scegliere una modalità freewheeling che si attiva quando il motore è fermo e la corrente di standby (parametro asse n. 7) è impostata a 0.

source: From Waveshare Wiki
it_it: Dal Wiki di Waveshare

source: From version 4 on, the TMCL-IDE can also use the CANopen protocol.
it_it: Dalla versione 4 in poi, TMCL-IDE può utilizzare anche il protocollo CANopen.

source: Function
it_it: Funzione

source: Function Description
it_it: Descrizione del Funzionamento

source: Function: This column shows the functionality of single bits in the register, like in the chip datasheet.
it_it: Function: Questa colonna mostra la funzionalità dei singoli bit nel registro, come nel datasheet del chip.

source: Functions in Constant Expressions
it_it: Funzioni nelle Espressioni Costanti

source: Furthermore, the TMCL-IDE also contains some CANopen specific tools.
it_it: Inoltre, TMCL-IDE contiene anche alcuni strumenti specifici per CANopen.

source: GND (Connect IT FIRST, configure TF-Luna for I2C mode (required for TF-Luna))
it_it: GND (Collegarlo PRIMA, configurare TF-Luna per la modalità I2C (necessaria per TF-Luna))

source: GND (Connect first and configure TF-Luna to I2C mode (required for TF-Luna))
it_it: GND (Connettere prima e configurare TF-Luna in modalità I2C (necessaria per TF-Luna))

source: GND (Connect it first, configure TF-Luna for I2C mode (required for TF-Luna))
it_it: GND (Collegarlo PRIMA, configurare TF-Luna per la modalità I2C (necessaria per TF-Luna))

source: GND : The pin is connected to ground and thus tied low.
it_it: GND : Il pin è collegato a massa e quindi è basso.

source: GT911 Datasheet
it_it: Datasheet di ST7262

source: General conventions
it_it: Convenzioni Generali

source: Generate a read command for the selected register and send this command to the TMCL/PC host.
it_it: Generare un comando di lettura per il registro selezionato e inviarlo all'host TMCL/PC.

source: Generate a symbol file: The assembler generates a text file that contains the address of every label.
it_it: Generate a symbol file: L'assembler genera un file di testo contenente l'indirizzo di ogni label.

source: Generate a write command for the selected register and send this command to the TMCL/PC host.
it_it: Generare un comando di scrittura per il registro selezionato e inviarlo all'host TMCL/PC.

source: Generating DCF Files
it_it: Generazione di File DCF

source: Getting the TMCL-IDE
it_it: Ottenere TMCL-IDE

source: Global parameters 64.
it_it: I Parametri globali 64.

source: Go to the "USB-TO-UART-I2C-SPI-JTAG-Demo\Windows\Software\OpenOCD-CH347\bin" directory in the path of the package (the demo is for the desktop).
it_it: Passare alla directory "USB-TO-UART-I2C-SPI-JTAG-Demo\Windows\Software\OpenOCD-CH347\bin" nel path del pacchetto (la demo è per il desktop).

source: Go to the SPI folder, and choose to open the example.py file.
it_it: Andare alla cartella SPI e scegliere di aprire il file "example.py".

source: Go to the UART folder, and choose to open the UART.py file (please check if it is the corresponding port.)
it_it: Spostarsi alla cartella UART e scegliere di aprire il file UART.py (verificare che si tratta della porta corrispondente,)

source: Green 2nd place
it_it: Verde 2° posto

source: Green 4th place
it_it: Verde 4° posto

source: Green 5th place
it_it: Verde 5° posto

source: Green 6th place
it_it: Verde 6° posto

source: Green 7th place
it_it: Verde 7° posto

source: Green data 3rd place
it_it: Verde dati 3° posto

source: Green: The standard deviation is very low or zero.
it_it: Verde: La deviazione standard è molto bassa o pari a zero.

source: Hardware Connection
it_it: Connessione Hardware

source: Hardware connection
it_it: Collegamento hardware

source: Help: Visit TRINAMIC YouTube channel, show some system info, open this document or looking for updates.
it_it: Help: Visita il canale YouTube di TRINAMIC, mostra alcune informazioni di sistema, apre questo documento o cerca aggiornamenti.

source: Here are also differences between the Windows version and the Linux version of the TMCL-IDE.
it_it: Ecco anche le differenze tra la versione Windows e quella Linux di TMCL-IDE.

source: Here are some additional hints for firmware updates, especially for the case that updating the firmware should not work as expected.
it_it: Ecco alcuni suggerimenti aggiuntivi per gli aggiornamenti del firmware, in particolare nel caso in cui l'aggiornamento del firmware non funzioni come previsto.

source: Here are some general conventions that apply throughout the entire TMCM-IDE.
it_it: Ecco alcune convenzioni generali che si applicano all'intero TMCM-IDE.

source: Here is a list of all commands that use the additional module index parameter:
it_it: Ecco un elenco di tutti i comandi che utilizzano il parametro aggiuntivo Indice Modulo:

source: Here is a list of all wizards that are available in the current version of the TMCL-IDE:
it_it: Ecco un elenco di tutti i "wizard" [procedure guidate] disponibili nella versione corrente di TMCL-IDE:

source: Here is how to use the StallGuard profiler:
it_it: Ecco come utilizzare il profiler StallGuard:

source: Here it can be changed further (which is not often needed by normal users).
it_it: Qui è possibile apportare ulteriori modifiche (cosa che non è spesso necessaria agli utenti normali).

source: Here the following options can be selected:
it_it: Qui è possibile selezionare le seguenti opzioni:

source: Here you can enter the new value either as a decimal value or as a hexadecimal value.
it_it: Qui è possibile immettere il nuovo valore decimale o esadecimale.

source: Here you can find most needed common tools like firmware update tool, TMCL-PC Host or the compilation of several wizards.
it_it: Qui si possono trovare i tool più comuni, come lo strumento di aggiornamento firmware, TMCL-PC Host o la compilazione di diverse procedure guidate.

source: Here, TMCL programs can be entered and modified.
it_it: Qui è possibile inserire e modificare i programmi TMCL.

source: Here, a directory called UserEds can be found.
it_it: Qui si trova una directory chiamata UserEds.

source: Here, one of the connected modules can be chosen.
it_it: Qui è possibile scegliere uno dei moduli connessi.

source: Hexadecimal numbers are always shown preceded by “0x”, like in C language.
it_it: I numeri esadecimali sono sempre visualizzati preceduti da "0x", come nel linguaggio C.

source: Hexadecimal numbers start with a $ sign, binary numbers start with a % sign.
it_it: I numeri esadecimali iniziano con il segno $, i numeri binari con il segno %.

source: Hexadecimal: Selects hexadecimal value representation (same function as double clicking the value).
it_it: Hexadecimal: Seleziona la rappresentazione esadecimale (stessa funzione del doppio clic sul valore).

source: High speed chopper mode: Switch to a different chopper mode when this option is checked and the speed is above the high speed threshold value.
it_it: High speed chopper mode: Passa a una modalità Chopper diversa quando questa opzione è selezionata e la velocità è superiore al valore di soglia per l'alta velocità.

source: High speed fullstep mode: Switch to fullstep mode when this option is checked and the speed is above the high speed threshold value.
it_it: High speed fullstep mode: Passa alla modalità Fullstep quando questa opzione è selezionata e la velocità è superiore al valore di soglia per l'alta velocità.

source: High-performance 32-bit Xtensa LX7 dual-core processor with a frequency up to 240MHz
it_it: Processore dual-core Xtensa LX7 a 32 bit ad alte prestazioni con frequenza fino a 240 MHz

source: Higher values will cause StallGuard2 to be less sensitive.
it_it: Valori più elevati renderanno StallGuard2 meno sensibile.

source: Hints for Firmware Updates
it_it: Suggerimenti per gli Aggiornamenti del Firmware

source: Hints for Peak CAN Interfaces
it_it: Suggerimenti per le interfacce Peak CAN

source: Hope it can help you!
it_it: Si spera che possa essere utile!

source: Horizontal synchronization signal
it_it: Segnale di sincronizzazione orizzontale

source: Hovering with the pointer of one of the closed-loop parameters shows the axis parameter number.
it_it: Passando col puntatore del mouse su uno dei parametri closed-loop viene visualizzato il numero del parametro dell'asse.

source: How to Use I2C Interface
it_it: Come Utilizzare l'Interfaccia I2C

source: However when it is not set, then the P and I parameters can be set to a certain value and the PI tuning will start from those values of P and I respectively.
it_it: Tuttavia, quando non è impostata, i parametri P e I possono essere impostati a un determinato valore e la regolazione PI partirà da quei valori di P e I rispettivamente.

source: However, no responsibility is assumed for the consequences of its use nor for any infringement of patents or other rights of third parties which may result from its use.
it_it: Tuttavia, non si assume alcuna responsabilità per le conseguenze del suo utilizzo né per eventuali violazioni di brevetti o altri diritti di terzi che possano derivarne.

source: However, some open-source libraries or custom libraries are not synchronized to the Arduino Library Manager, so they cannot be acquired through online searches.
it_it: Tuttavia, alcune librerie open source o personalizzate non sono sincronizzate con Arduino Library Manager, quindi non possono essere acquisite tramite ricerche online.

source: Hysteresis start (SAP 172): determines the lower end of the CoolStep hysteresis.
it_it: Hysteresis start (SAP 172): determina il limite inferiore dell'isteresi CoolStep.

source: Hysteresis width (SAP 170): determines the width and hence the upper end of the CoolStep hysteresis.
it_it: Hysteresis width (SAP 170): determina l'ampiezza e quindi il limite superiore dell'isteresi CoolStep.

source: I2C Debug Ranging Module Using Host Computer
it_it: Modulo di Debug I2C Tramite Computer Host

source: I2C Gets Range Measuring Module Data In Python IDE
it_it: I2C Recuperare i Dati del Modulo di Misurazione della Portata nell'IDE Python

source: I2C Gets Ranging Module Data in Python Environment
it_it: I2C Ottiene i Dati del Ranging di Intervallo nell'Ambiente Python

source: I2C Interface Usage
it_it: Utilizzo dell'interfaccia I2C

source: I2C and SPI are for Host/Master mode.
it_it: I2C e SPI sono per la modalità Host/Master.

source: I2C clock pin
it_it: Pin clock I2C

source: I2C data pin
it_it: Pin dati I2C

source: I2C interface: ESP32-S3 provides multi-channel hardware I2C, currently using GPIO8 (SDA) and GPIO9 (SCL) pins for I2C bus
it_it: I2C interface: ESP32-S3 fornisce hardware I2C multicanale, attualmente utilizzando pin GPIO8 (SDA) e GPIO9 (SCL) per il bus I2C.

source: I2C terminal
it_it: Terminale I2C

source: I2C.VCC ((Keeping the OLED in operation (required for OLED))
it_it: I2C.VCC ((Mantenere l'OLED in funzione (necessario per gli OLED))

source: INI file: an INI file can also be read back by the export/import utility and written to the registers again.
it_it: INI file: un file INI può anche essere letto dall'utilità di esportazione/importazione e riscritto nei registri.

source: INI files can only be used with this tool.
it_it: I file INI possono essere utilizzati solo con questo strumento.

source: IO expansion chip
it_it: Chip di espansione IO

source: If a module does not respond to a command the program will be aborted with an error.
it_it: Se un modulo non risponde a un comando, il programma verrà interrotto con un errore.

source: If a received data alert is triggered, the messages are received in a loop and the handle_rx_message function is called to process each received message.
it_it: Se viene attivato un avviso di dati ricevuti, i messaggi vengono ricevuti in un ciclo e la funzione handle_rx_message viene chiamata per elaborare ciascun messaggio ricevuto.

source: If an EDS file from the UserEds directory contains the same vendor ID and product ID as an EDS file that is already built into the TMCL-IDE then the EDS file from the UserEds directory will be used.
it_it: Se un file EDS dalla directory UserEds contiene lo stesso ID fornitore e ID prodotto di un file EDS già integrato in TMCL-IDE, verrà utilizzato il file EDS dalla directory UserEds.

source: If an error occurs, the line containing the error will be highlighted and the assembly will be aborted.
it_it: Se si verifica un errore, la riga contenente l'errore verrà evidenziata e l'assemblaggio verrà interrotto.

source: If an object contains sub indices, an arrow will be shown beneath the object entry.
it_it: Se un oggetto contiene sottoindici, verrà visualizzata una freccia sotto la voce dell'oggetto.

source: If an object value is not to be written to the DCF file, uncheck its Component of DCF file checkbox in the Object Browser or uncheck its DCF Use checkbox in the DCF Values tab in this tool before generating the DCF file.
it_it: Se un valore di oggetto non deve essere scritto nel file DCF, deselezionare la checkbox Component of DCF file nel Object Browser o deselezionare la checkbox DCF Use nel tab DCF Values di questo strumento prima di generare il file DCF.

source: If another module has been connected while the Firmware Update Tool is open press the Refresh button to refresh the list of available modules.
it_it: Selezionare un altro modulo mentre il Firmware Update Tool è aperto, quindi premere il pulsante Refresh per aggiornare l'elenco dei moduli disponibili.

source: If anything should go wrong and the update process has been aborted, you can just try again.
it_it: Se qualcosa dovesse andare storto e il processo di aggiornamento è stato interrotto, è possibile riprovare.

source: If cyclic update is switched off then the flags view will not be updated automatically.
it_it: Se l'aggiornamento ciclico è disattivato, la vista flag non verrà aggiornata automaticamente.

source: If desired the automatic board detection can be re-started by clicking the Scan button.
it_it: Se lo si desidera, è possibile riavviare il rilevamento automatico delle board cliccando sul pulsante Scan.
